#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fiap-pos-tech/cart-service/runs/run-BQsoTZw6xRPxHt6c

Waiting for the plan to start...

Terraform v1.7.1
on linux_amd64
Initializing plugins and modules...
data.aws_ecs_cluster.cluster: Refreshing...
data.aws_apigatewayv2_api.tech_challenge_api: Refreshing...
data.aws_security_group.vpc_endpoint_sm_cl: Refreshing...
data.aws_vpc.main: Refreshing...
data.aws_lb.product_alb: Refreshing...
data.aws_lb.customer_alb: Refreshing...
data.aws_apigatewayv2_vpc_link.gateway_vpc_link: Refreshing...
data.aws_ecs_cluster.cluster: Refresh complete after 0s [id=arn:aws:ecs:us-east-1:598135944514:cluster/tech-challenge]
data.aws_security_group.vpc_endpoint_sm_cl: Refresh complete after 0s [id=sg-0e2dc7c7e10243507]
data.aws_apigatewayv2_api.tech_challenge_api: Refresh complete after 0s [id=5am5sutwt1]
data.aws_apigatewayv2_vpc_link.gateway_vpc_link: Refresh complete after 0s [id=9sezcf]
data.aws_lb.customer_alb: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:598135944514:loadbalancer/app/customer-service-alb/70ced61ac92523b9]
data.aws_lb.product_alb: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:598135944514:loadbalancer/app/product-service-alb/a150b1aaf7dbe912]
data.aws_vpc.main: Refresh complete after 0s [id=vpc-0c5a69114563ca731]
data.aws_subnets.database_subnet_ids: Refreshing...
data.aws_subnets.private_subnet_ids: Refreshing...
data.aws_subnets.database_subnet_ids: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.database_selected["subnet-00f22e8c798c2dc4f"]: Refreshing...
data.aws_subnet.database_selected["subnet-0fe0ac5ee5dfc62a8"]: Refreshing...
data.aws_subnets.private_subnet_ids: Refresh complete after 0s [id=us-east-1]
data.aws_subnet.private_selected["subnet-0f6198953ee43af96"]: Refreshing...
data.aws_subnet.private_selected["subnet-04fba355f9c419a79"]: Refreshing...
data.aws_subnet.private_selected["subnet-03ac578c469316b7b"]: Refreshing...
data.aws_subnet.database_selected["subnet-0fe0ac5ee5dfc62a8"]: Refresh complete after 0s [id=subnet-0fe0ac5ee5dfc62a8]
data.aws_subnet.private_selected["subnet-0f6198953ee43af96"]: Refresh complete after 0s [id=subnet-0f6198953ee43af96]
data.aws_subnet.database_selected["subnet-00f22e8c798c2dc4f"]: Refresh complete after 0s [id=subnet-00f22e8c798c2dc4f]
data.aws_subnet.private_selected["subnet-03ac578c469316b7b"]: Refresh complete after 0s [id=subnet-03ac578c469316b7b]
data.aws_subnet.private_selected["subnet-04fba355f9c419a79"]: Refresh complete after 0s [id=subnet-04fba355f9c419a79]
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "database_admin_password"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-BQsoTZw6xRPxHt6c/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-BQsoTZw6xRPxHt6c/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.apigw_integration will be created
  + resource "aws_apigatewayv2_integration" "apigw_integration" {
      + api_id                                    = "5am5sutwt1"
      + connection_id                             = "9sezcf"
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.apigw_route_to_all_internal will be created
  + resource "aws_apigatewayv2_route" "apigw_route_to_all_internal" {
      + api_id             = "5am5sutwt1"
      + api_key_required   = false
      + authorization_type = "CUSTOM"
      + authorizer_id      = "kjuc2x"
      + id                 = (known after apply)
      + route_key          = "ANY /cart/{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.apigw_route_to_root will be created
  + resource "aws_apigatewayv2_route" "apigw_route_to_root" {
      + api_id             = "5am5sutwt1"
      + api_key_required   = false
      + authorization_type = "CUSTOM"
      + authorizer_id      = "kjuc2x"
      + id                 = (known after apply)
      + route_key          = "ANY /cart"
      + target             = (known after apply)
    }

  # aws_cloudwatch_log_group.service_log_group will be created
  + resource "aws_cloudwatch_log_group" "service_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/cart-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "name" = "/ecs/cart-service"
        }
      + tags_all          = {
          + "name"     = "/ecs/cart-service"
          + "workload" = "cart-service"
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = "arn:aws:ecs:us-east-1:598135944514:cluster/tech-challenge"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 120
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "cart-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "workload" = "cart-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "cart-service-container"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-03ac578c469316b7b",
              + "subnet-04fba355f9c419a79",
              + "subnet-0f6198953ee43af96",
            ]
        }
    }

  # aws_ecs_task_definition.task_definition will be created
  + resource "aws_ecs_task_definition" "task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "tsk-cart-service"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "workload" = "cart-service"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_elasticache_replication_group.redis will be created
  + resource "aws_elasticache_replication_group" "redis" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "cache for cart purposes"
      + engine                         = "redis"
      + engine_version                 = "6.x"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = (known after apply)
      + node_type                      = "cache.t3.micro"
      + num_cache_clusters             = 1
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "default.redis6.x"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "cart-service-redis"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "cart-service-redis-subnet-group"
      + tags_all                       = {
          + "workload" = "cart-service"
        }
      + transit_encryption_enabled     = false
    }

  # aws_elasticache_subnet_group.redis_subnet_group will be created
  + resource "aws_elasticache_subnet_group" "redis_subnet_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "cart-service-redis-subnet-group"
      + subnet_ids  = [
          + "subnet-03ac578c469316b7b",
          + "subnet-04fba355f9c419a79",
          + "subnet-0f6198953ee43af96",
        ]
      + tags        = {
          + "Name" = "cart-service-redis-subnet-group"
        }
      + tags_all    = {
          + "Name"     = "cart-service-redis-subnet-group"
          + "workload" = "cart-service"
        }
    }

  # aws_iam_role.service_execution_role will be created
  + resource "aws_iam_role" "service_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "01"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cart_service_service_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "workload" = "cart-service"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.service_execution_policy will be created
  + resource "aws_iam_role_policy" "service_execution_policy" {
      + id          = (known after apply)
      + name        = "cart_service_service_execution_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "cart-service-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-03ac578c469316b7b",
          + "subnet-04fba355f9c419a79",
          + "subnet-0f6198953ee43af96",
        ]
      + tags                                                         = {
          + "name" = "cart-service-alb"
        }
      + tags_all                                                     = {
          + "name"     = "cart-service-alb"
          + "workload" = "cart-service"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.listener_http will be created
  + resource "aws_lb_listener" "listener_http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "workload" = "cart-service"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "cart-service-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "workload" = "cart-service"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0c5a69114563ca731"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/monitor/health"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 10
        }
    }

  # aws_security_group.alb_sg will be created
  + resource "aws_security_group" "alb_sg" {
      + arn                    = (known after apply)
      + description            = "cart-service alb security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb-cart-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "alb-cart-service-sg"
        }
      + tags_all               = {
          + "Name"     = "alb-cart-service-sg"
          + "workload" = "cart-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group.redis_sg will be created
  + resource "aws_security_group" "redis_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "allow connection from ecs"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "cart_service_cache_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cart_service_cache_sg"
        }
      + tags_all               = {
          + "Name"     = "cart_service_cache_sg"
          + "workload" = "cart-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group.service_sg will be created
  + resource "aws_security_group" "service_sg" {
      + arn                    = (known after apply)
      + description            = "cart-service security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow Request From Target Group"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "cart-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cart-service-sg"
        }
      + tags_all               = {
          + "Name"     = "cart-service-sg"
          + "workload" = "cart-service"
        }
      + vpc_id                 = "vpc-0c5a69114563ca731"
    }

  # aws_security_group_rule.ecs_to_vpc_endpoints will be created
  + resource "aws_security_group_rule" "ecs_to_vpc_endpoints" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0e2dc7c7e10243507"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # aws_sns_topic.cart_closed_topic will be created
  + resource "aws_sns_topic" "cart_closed_topic" {
      + arn                                   = (known after apply)
      + beginning_archive_time                = (known after apply)
      + content_based_deduplication           = false
      + delivery_policy                       = jsonencode(
            {
              + http = {
                  + defaultHealthyRetryPolicy    = {
                      + maxDelayTarget     = 20
                      + minDelayTarget     = 20
                      + numMaxDelayRetries = 0
                      + numMinDelayRetries = 0
                      + numNoDelayRetries  = 0
                      + numRetries         = 3
                    }
                  + defaultThrottlePolicy        = {
                      + maxReceivesPerSecond = 10
                    }
                  + disableSubscriptionOverrides = false
                }
            }
        )
      + fifo_topic                            = false
      + firehose_success_feedback_sample_rate = 0
      + http_success_feedback_sample_rate     = 0
      + id                                    = (known after apply)
      + kms_master_key_id                     = "alias/aws/sns"
      + name                                  = "prd-cart-closed-topic"
      + name_prefix                           = (known after apply)
      + owner                                 = (known after apply)
      + policy                                = (known after apply)
      + signature_version                     = (known after apply)
      + tags_all                              = {
          + "workload" = "cart-service"
        }
      + tracing_config                        = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @giovanischram, Action: `pull_request`*